//
//  BJ_2864.swift
//  Algorithm
//
//  Created by 방현석 on 10/3/24.
//

import Foundation

// MARK: <#제목#>


/**
 
 - 문제
 상근이는 2863번에서 표를 너무 열심히 돌린 나머지 5와 6을 헷갈리기 시작했다.

 상근이가 숫자 5를 볼 때, 5로 볼 때도 있지만, 6으로 잘못 볼 수도 있고, 6을 볼 때는, 6으로 볼 때도 있지만, 5로 잘못 볼 수도 있다.

 두 수 A와 B가 주어졌을 때, 상근이는 이 두 수를 더하려고 한다. 이때, 상근이가 구할 수 있는 두 수의 가능한 합 중, 최솟값과 최댓값을 구해 출력하는 프로그램을 작성하시오.


 
 - 입력
 첫째 줄에 두 정수 A와 B가 주어진다. (1 <= A,B <= 1,000,000)


 
 - 출력
 첫째 줄에 상근이가 구할 수 있는 두 수의 합 중 최솟값과 최댓값을 출력한다.


 
 - 예제1
 - 예제 입력 :
 11 25

 - 예제 출력 :
 36 37
 
 - 예제2
 - 예제 입력 :
 1430 4862
 - 예제 출력 :
 6282 6292
 
 - 예제3
 - 예제 입력 :
 16796 58786
 - 예제 출력 :
 74580 85582
 
 */

// MARK: 내 답
/// 1. 아이디어
/// - 입력값 a와 b추출하여 배열에 넣기
/// - 배열요소를 문자열로 바꾸고  6이 있다면 5로 바꾸고 다시 Int배열로 변경
/// - 모든 요소를 더하면 최소값
/// - 5가 있다면 6으로 바꾸고 IntArray로 변경하여 더하면 최대값
/// 2. 시간복잡도
/// 3. 자료구조



// MARK: Insight
/*
 <#text#>
 */


// MARK: Other Idea
/*
 <#text#>
 */


// MARK: 다른 답 중 인상적인 답
